---
type: VertexPosition
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 3
tags: [revit-api, class]
---

# VertexPosition

`Autodesk.Revit.DB.DirectContext3D.VertexPosition` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexPosition | 2017 | `public VertexPosition ( XYZ position )` |
| Method | GetSizeInFloats | 2017 | `public static int GetSizeInFloats ()` |
| Property | Position | 2017 | `public XYZ Position { get ; set ; }` |